# warnings-disable
extends RefCounted

var True = true
var False = false
var None = null


var data = \
{
70001:{ "id":70001,  "name":'天国之门',  "cost":[1, 0],  "desc":'开启天国之门。',  "last":'',  "effect":'',  "img":'', },
70002:{ "id":70002,  "name":'贤者之屋',  "cost":[9.9, 1],  "desc":'解锁更换背景的能力。',  "last":'70001.0',  "effect":'',  "img":'', },
70003:{ "id":70003,  "name":'贤者之歌',  "cost":[1, 11],  "desc":'解锁更换点击音效的能力。',  "last":'70001.0',  "effect":'',  "img":'', },
70004:{ "id":70004,  "name":'贤者之城',  "cost":[1, 7],  "desc":'增加更多背景',  "last":'70002.0',  "effect":'',  "img":'', },
70005:{ "id":70005,  "name":'思考的盐、硫、汞',  "cost":[1.5, 7],  "desc":'',  "last":'70025.0',  "effect":'',  "img":'', },
70006:{ "id":70006,  "name":'思考的铁匠',  "cost":[1.9, 9],  "desc":'',  "last":'70005.0',  "effect":'',  "img":'', },
70007:{ "id":70007,  "name":'思考的炼金术士',  "cost":[3.3, 10],  "desc":'',  "last":'70006.0',  "effect":'',  "img":'', },
70008:{ "id":70008,  "name":'思考的炼金锅',  "cost":[2.5, 11],  "desc":'',  "last":'70007.0',  "effect":'',  "img":'', },
70009:{ "id":70009,  "name":'思考的炼金石磨',  "cost":[1.2, 12],  "desc":'',  "last":'70008.0',  "effect":'',  "img":'', },
70010:{ "id":70010,  "name":'思考的炼成阵',  "cost":[4.2, 12],  "desc":'',  "last":'70009.0',  "effect":'',  "img":'', },
70011:{ "id":70011,  "name":'思考的红宝石',  "cost":[1.2, 13],  "desc":'',  "last":'70010.0',  "effect":'',  "img":'', },
70012:{ "id":70012,  "name":'思考的王水',  "cost":[3.1, 13],  "desc":'',  "last":'70011.0',  "effect":'',  "img":'', },
70013:{ "id":70013,  "name":'思考的长生露',  "cost":[7.2, 13],  "desc":'',  "last":'70012.0',  "effect":'',  "img":'', },
70014:{ "id":70014,  "name":'思考的五芒星',  "cost":[1.5, 14],  "desc":'',  "last":'70013.0',  "effect":'',  "img":'', },
70015:{ "id":70015,  "name":'思考的太阳',  "cost":[2.9, 14],  "desc":'',  "last":'70014.0',  "effect":'',  "img":'', },
70016:{ "id":70016,  "name":'思考的月亮',  "cost":[5.4, 14],  "desc":'',  "last":'70015.0',  "effect":'',  "img":'', },
70017:{ "id":70017,  "name":'思考的黄金之塔',  "cost":[9.4, 14],  "desc":'',  "last":'70016.0',  "effect":'',  "img":'', },
70018:{ "id":70018,  "name":'思考的卡巴拉之术',  "cost":[1.6, 15],  "desc":'',  "last":'70017.0',  "effect":'',  "img":'', },
70019:{ "id":70019,  "name":'思考的星锑',  "cost":[2.6, 15],  "desc":'',  "last":'70018.0',  "effect":'',  "img":'', },
70020:{ "id":70020,  "name":'思考的圣杯',  "cost":[4.0, 15],  "desc":'',  "last":'70019.0',  "effect":'',  "img":'', },
70021:{ "id":70021,  "name":'思考的贤者之石',  "cost":[6.2, 15],  "desc":'',  "last":'70020.0',  "effect":'',  "img":'', },
70022:{ "id":70022,  "name":'思考的天国阶梯',  "cost":[9.2, 15],  "desc":'',  "last":'70021.0',  "effect":'',  "img":'', },
70023:{ "id":70023,  "name":'思考的暗物质星系',  "cost":[1.3, 16],  "desc":'',  "last":'70022.0',  "effect":'',  "img":'', },
70024:{ "id":70024,  "name":'思考的平行宇宙',  "cost":[1.9, 16],  "desc":'',  "last":'70023.0',  "effect":'',  "img":'', },
70025:{ "id":70025,  "name":'遐思',  "cost":[1, 7],  "desc":'让所有物品获得思考的能力。',  "last":'',  "effect":'',  "img":'', },

}

